{
    "ui": {
        "title": "Daily Typing Challenge",
        "restart": "Redémarrer",
        "resetRecords": "Réinitialiser",
        "pressEnter": "Appuyez sur Entrée pour valider",
        "statPlayed": "Parties",
        "statBest": "Meilleur temps",
        "statLast": "Dernier temps",
        "changeLangWarning": "Changer de langue réinitialisera votre progression. Continuer ?",
        "errorMismatch": "Phrase incorrecte.",
        "inputPlaceholder": "Tapez la citation exactement...",
        "stage": "Étape",
        "completed": "Terminé !",
        "badge": "Défi du Jour",
        "guide": {
            "title": "Comment Jouer",
            "items": [
                "Tapez la phrase exactement comme elle apparaît.",
                "Vous devez respecter les espaces et la ponctuation à la lettre.",
                "Le minuteur démarre à la première frappe. Appuyez sur Entrée pour valider.",
                "Vous ne pouvez pas passer à l'étape suivante en cas d'erreur.",
                "Terminez les 3 étapes pour voir votre résultat.",
                "Une nouvelle citation est publiée chaque jour. Le défi d'aujourd'hui n'est disponible qu'aujourd'hui.",
                "Si vous avez confiance en votre vitesse, relevez le défi !"
            ]
        },
        "infoSection": {
            "title": "Pourquoi Daily Typing Challenge ?",
            "items": [
                {
                    "title": "Développez Mémoire Musculaire et Vitesse",
                    "desc": "Une pratique quotidienne constante est la clé pour maîtriser la dactylographie. Notre algorithme sélectionne des phrases uniques chaque jour pour éviter la mémorisation par cœur et garantir un véritable traitement du texte."
                },
                {
                    "title": "Maîtrise Multilingue",
                    "desc": "En tapant des citations en anglais, coréen, japonais, espagnol et français, vous améliorez non seulement votre WPM mais vous vous familiarisez aussi avec diverses structures de phrases et de vocabulaire."
                },
                {
                    "title": "Système de Classement Scientifique",
                    "desc": "Contrairement aux simples moyennes, notre classement est basé sur une distribution normale gaussienne des vitesses de frappe mondiales. Votre \"Top %\" reflète votre véritable position parmi les dactylographes du monde entier."
                }
            ]
        },
        "footer": {
            "privacy": "Politique de Confidentialité",
            "terms": "Conditions d'Utilisation",
            "copyright": "© 2026 Daily Typing Challenge. All rights reserved."
        }
    }
}